// Вам необхідно написати функцію summarize(num), яка приймає на вхід число і повертає функцію,
//     яка під час виклику додає це число до аргументу і повертає результат. Якщо аргумент не передано,
//     то додається одиниця. Наприклад, якщо функція викликається з аргументом 5, то функція, що повертається,
//     повинна при виклику з аргументом 3 повернути 8 (тому що 3 + 5 = 8) або 6, якщо аргумент не буде передано.
function summarize(num) {
    if (typeof num === 'undefined') {
        num = 1;
    }
    return function (arg) {
        return arg + num;
    };
}
const addFive = summarize(5);
console.log(addFive(3));
const addOne = summarize();
console.log(addOne(6));